# Pandas

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

1. 1D data is called series data
2. 2D data is called dataframe data
3. 3D and above data is called panel data

In [2]:
Dataset="../Datasets"

In [ ]:
cars_df=pd.read_csv(Dataset+'/cars.csv')
cars_df.head(20)
cars_df.tail(20)
cars_df.sample(20)
cars_df.columns
type(cars_df)
cars_df.shape
cars_df.describe()
cars_df.info()

**There are 3 type of Data structure in pandas**
1. Series: It is 1D array which assign index to each value.
2. Dataframe: It is 2D array. Its a tabular data structure.
3. Panel: It has 3 dimensional and more dimensional array.

In [3]:
series1= pd.Series([10,20,30,40])
series1

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
series1.values

array([10, 20, 30, 40], dtype=int64)

In [5]:
series1.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
series2=pd.Series([10,20,30,40,50], index=['one','two','three','four','five'])

In [7]:
series2

one      10
two      20
three    30
four     40
five     50
dtype: int64

In [8]:
series2.values
series2.index

array([10, 20, 30, 40, 50], dtype=int64)

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [9]:
series2[['four','five']]
series2[3:] # Even if we create index pandas maintain default numeric index

four    40
five    50
dtype: int64

four    40
five    50
dtype: int64

In [10]:
series2+6
series2**2

one      16
two      26
three    36
four     46
five     56
dtype: int64

one       100
two       400
three     900
four     1600
five     2500
dtype: int64

**Filtering the data from series**

In [11]:
series2[series2>20]

three    30
four     40
five     50
dtype: int64

In [12]:
np.sqrt(series2)

one      3.162278
two      4.472136
three    5.477226
four     6.324555
five     7.071068
dtype: float64

In [13]:
year=[90,91,92,93,94,95]
f1={90:8,91:9,92:10,93:11,94:12,95:13}
firm1=pd.Series(f1,index=year) # Here we are converting dictionary into a series we can do the same with set, list, tuple

In [14]:
firm1

90     8
91     9
92    10
93    11
94    12
95    13
dtype: int64

In [15]:
f2={90:32,92:24,93:45,94:56}
firm2=pd.Series(f2,index=year) 
modified_firm2=pd.Series(f2)

1. ```since we dont have any value assigned to key with number 91,95 which is part of index we have NaN for that index.```
2. ```Since we have not assigned year as index so it will take key in dictionary f2 as the key since there is no 91,95 key it will not have NaN.```

In [16]:
firm2 
modified_firm2

90    32.0
91     NaN
92    24.0
93    45.0
94    56.0
95     NaN
dtype: float64

90    32
92    24
93    45
94    56
dtype: int64

In [17]:
year=[90,91,92,93,94,95,96,97,98,99]
f3={93:10,94:34,95:78}
firm3=pd.Series(f3,index=year)
modified_firm3=pd.Series(f3)

In [18]:
firm3
firm3.index
firm3.values
modified_firm3
modified_firm3.values
modified_firm3.index

90     NaN
91     NaN
92     NaN
93    10.0
94    34.0
95    78.0
96     NaN
97     NaN
98     NaN
99     NaN
dtype: float64

Int64Index([90, 91, 92, 93, 94, 95, 96, 97, 98, 99], dtype='int64')

array([nan, nan, nan, 10., 34., 78., nan, nan, nan, nan])

93    10
94    34
95    78
dtype: int64

array([10, 34, 78], dtype=int64)

Int64Index([93, 94, 95], dtype='int64')

```NaN indicate missing value or na in panda indicate missing value you can isnull() function to find if there is any null values```

In [19]:
firm3.isnull()
pd.isnull(firm3)

90     True
91     True
92     True
93    False
94    False
95    False
96     True
97     True
98     True
99     True
dtype: bool

90     True
91     True
92     True
93    False
94    False
95    False
96     True
97     True
98     True
99     True
dtype: bool

In [20]:
years_f4=[90,93]
f4={93:10,94:34,95:78}
firm4=pd.Series(f4,index=years_f4) 
firm4 #since 94 and 95 is not there in year list hence firm4 will not have value associated with 94,95 from f4

90     NaN
93    10.0
dtype: float64

In [21]:
pd.isnull(firm4)

90     True
93    False
dtype: bool

In [22]:
pd.isnull(firm3)
firm3[:]

90     True
91     True
92     True
93    False
94    False
95    False
96     True
97     True
98     True
99     True
dtype: bool

90     NaN
91     NaN
92     NaN
93    10.0
94    34.0
95    78.0
96     NaN
97     NaN
98     NaN
99     NaN
dtype: float64

In [23]:
dict1={'finance':10,'earning':5,'debt':8}
dict2={'finance':8,'compensation':4,'earning':9}
count1=pd.Series(dict1)
count1
count2=pd.Series(dict2)
count2
count3=count1+count2
count3
count3.values
count3.index

debt        8
earning     5
finance    10
dtype: int64

compensation    4
earning         9
finance         8
dtype: int64

compensation     NaN
debt             NaN
earning         14.0
finance         18.0
dtype: float64

array([nan, nan, 14., 18.])

Index(['compensation', 'debt', 'earning', 'finance'], dtype='object')

In [24]:
data=pd.DataFrame({'price':[95,25,81,78,89],
                   'ticker':['AXP','CSCO','DIS','MSFT','WMT'],
                   'company':['American Express','Cisco','Walt Disney','Microsoft','Walmart']})

In [25]:
data

            company  price ticker
0  American Express     95    AXP
1             Cisco     25   CSCO
2       Walt Disney     81    DIS
3         Microsoft     78   MSFT
4           Walmart     89    WMT

In [26]:
data['company']

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

In [27]:
data['ticker']

0     AXP
1    CSCO
2     DIS
3    MSFT
4     WMT
Name: ticker, dtype: object

In [28]:
data[3:]

     company  price ticker
3  Microsoft     78   MSFT
4    Walmart     89    WMT

1. loc primarily used with lable but can be used with index. It need atleast one lable
2. iloc is only use index for getting data

In [29]:
data.iloc[0:2,0:2]
data.iloc[1,1]

            company  price
0  American Express     95
1             Cisco     25

25

In [30]:
data.iloc[3,2]

'MSFT'

In [31]:
data.iloc[2:4,]
data.iloc[2:4,:]

       company  price ticker
2  Walt Disney     81    DIS
3    Microsoft     78   MSFT

       company  price ticker
2  Walt Disney     81    DIS
3    Microsoft     78   MSFT

In [32]:
data.iloc[2:4,1]
data.iloc[2:4,1:]

2    81
3    78
Name: price, dtype: int64

   price ticker
2     81    DIS
3     78   MSFT

In [33]:
data.iloc[0:4,:]

            company  price ticker
0  American Express     95    AXP
1             Cisco     25   CSCO
2       Walt Disney     81    DIS
3         Microsoft     78   MSFT

In [34]:
data.loc[2:,['ticker','company']]

  ticker      company
2    DIS  Walt Disney
3   MSFT    Microsoft
4    WMT      Walmart

In [35]:
data.loc[:,['price']]

   price
0     95
1     25
2     81
3     78
4     89

In [36]:
data.loc[[0],:]

            company  price ticker
0  American Express     95    AXP

In [37]:
data['company']

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

In [38]:
data.company

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

In [39]:
data[data.price>80]

            company  price ticker
0  American Express     95    AXP
2       Walt Disney     81    DIS
4           Walmart     89    WMT

In [40]:
data['year']=2014

In [79]:
data
data[data.price>80]
data[data.price>80][1:]
data[data.price>80][['company','price','ticker','year']]

            company  price ticker  year  sqrtprice  pricesquared  sequence
0  American Express     95    AXP  2014        NaN           NaN         0
1             Cisco     25   CSCO  2014        NaN           NaN         5
2       Walt Disney     81    DIS  2014        NaN           NaN        10
3         Microsoft     78   MSFT  2014        NaN           NaN        15
4           Walmart     89    WMT  2014        NaN           NaN        20

            company  price ticker  year  sqrtprice  pricesquared  sequence
0  American Express     95    AXP  2014        NaN           NaN         0
2       Walt Disney     81    DIS  2014        NaN           NaN        10
4           Walmart     89    WMT  2014        NaN           NaN        20

       company  price ticker  year  sqrtprice  pricesquared  sequence
2  Walt Disney     81    DIS  2014        NaN           NaN        10
4      Walmart     89    WMT  2014        NaN           NaN        20

            company  price ticker  year
0  American Express     95    AXP  2014
2       Walt Disney     81    DIS  2014
4           Walmart     89    WMT  2014

In [84]:
data[data.price>80][~(data.company=='Walt Disney')][['company','price','ticker','year']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

            company  price ticker  year
0  American Express     95    AXP  2014
4           Walmart     89    WMT  2014

In [42]:
data['pricesquared']=data.price**2

In [43]:
data

            company  price ticker  year  pricesquared
0  American Express     95    AXP  2014          9025
1             Cisco     25   CSCO  2014           625
2       Walt Disney     81    DIS  2014          6561
3         Microsoft     78   MSFT  2014          6084
4           Walmart     89    WMT  2014          7921

In [44]:
data['sqrtprice']=np.sqrt(data.pricesquared)

In [45]:
data

            company  price ticker  year  pricesquared  sqrtprice
0  American Express     95    AXP  2014          9025       95.0
1             Cisco     25   CSCO  2014           625       25.0
2       Walt Disney     81    DIS  2014          6561       81.0
3         Microsoft     78   MSFT  2014          6084       78.0
4           Walmart     89    WMT  2014          7921       89.0

In [46]:
del data['pricesquared']

In [47]:
data

            company  price ticker  year  sqrtprice
0  American Express     95    AXP  2014       95.0
1             Cisco     25   CSCO  2014       25.0
2       Walt Disney     81    DIS  2014       81.0
3         Microsoft     78   MSFT  2014       78.0
4           Walmart     89    WMT  2014       89.0

In [48]:
data['pricesquared']=np.NaN
data['sqrtprice']=np.NaN

In [49]:
data

            company  price ticker  year  sqrtprice  pricesquared
0  American Express     95    AXP  2014        NaN           NaN
1             Cisco     25   CSCO  2014        NaN           NaN
2       Walt Disney     81    DIS  2014        NaN           NaN
3         Microsoft     78   MSFT  2014        NaN           NaN
4           Walmart     89    WMT  2014        NaN           NaN

In [50]:
data['sequence']=np.arange(0,25,5)

In [51]:
data

            company  price ticker  year  sqrtprice  pricesquared  sequence
0  American Express     95    AXP  2014        NaN           NaN         0
1             Cisco     25   CSCO  2014        NaN           NaN         5
2       Walt Disney     81    DIS  2014        NaN           NaN        10
3         Microsoft     78   MSFT  2014        NaN           NaN        15
4           Walmart     89    WMT  2014        NaN           NaN        20

In [52]:
data.values
data.shape
data.index
data
data.mean()
data.median()
data.std()
data.cumsum()
data.describe()
data.info()

array([['American Express', 95, 'AXP', 2014, nan, nan, 0],
       ['Cisco', 25, 'CSCO', 2014, nan, nan, 5],
       ['Walt Disney', 81, 'DIS', 2014, nan, nan, 10],
       ['Microsoft', 78, 'MSFT', 2014, nan, nan, 15],
       ['Walmart', 89, 'WMT', 2014, nan, nan, 20]], dtype=object)

(5, 7)

RangeIndex(start=0, stop=5, step=1)

            company  price ticker  year  sqrtprice  pricesquared  sequence
0  American Express     95    AXP  2014        NaN           NaN         0
1             Cisco     25   CSCO  2014        NaN           NaN         5
2       Walt Disney     81    DIS  2014        NaN           NaN        10
3         Microsoft     78   MSFT  2014        NaN           NaN        15
4           Walmart     89    WMT  2014        NaN           NaN        20

price             73.6
year            2014.0
sqrtprice          NaN
pricesquared       NaN
sequence          10.0
dtype: float64

price             81.0
year            2014.0
sqrtprice          NaN
pricesquared       NaN
sequence          10.0
dtype: float64

price           27.978563
year             0.000000
sqrtprice             NaN
pricesquared          NaN
sequence         7.905694
dtype: float64

,company,price,ticker,year,sqrtprice,pricesquared,sequence
0,American Express,95,AXP,2014,NaN,NaN,0
1,American ExpressCisco,120,AXPCSCO,4028,NaN,NaN,5
2,American ExpressCiscoWalt Disney,201,AXPCSCODIS,6042,NaN,NaN,15
3,American ExpressCiscoWalt DisneyMicrosoft,279,AXPCSCODISMSFT,8056,NaN,NaN,30
4,American ExpressCiscoWalt DisneyMicrosoftWalmart,368,AXPCSCODISMSFTWMT,10070,NaN,NaN,50

           price    year  sqrtprice  pricesquared   sequence
count   5.000000     5.0        0.0           0.0   5.000000
mean   73.600000  2014.0        NaN           NaN  10.000000
std    27.978563     0.0        NaN           NaN   7.905694
min    25.000000  2014.0        NaN           NaN   0.000000
25%    78.000000  2014.0        NaN           NaN   5.000000
50%    81.000000  2014.0        NaN           NaN  10.000000
75%    89.000000  2014.0        NaN           NaN  15.000000
max    95.000000  2014.0        NaN           NaN  20.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
company         5 non-null object
price           5 non-null int64
ticker          5 non-null object
year            5 non-null int64
sqrtprice       0 non-null float64
pricesquared    0 non-null float64
sequence        5 non-null int32
dtypes: float64(2), int32(1), int64(2), object(2)
memory usage: 340.0+ bytes

In [53]:
data

            company  price ticker  year  sqrtprice  pricesquared  sequence
0  American Express     95    AXP  2014        NaN           NaN         0
1             Cisco     25   CSCO  2014        NaN           NaN         5
2       Walt Disney     81    DIS  2014        NaN           NaN        10
3         Microsoft     78   MSFT  2014        NaN           NaN        15
4           Walmart     89    WMT  2014        NaN           NaN        20

In [74]:
newdata= data.drop(['pricesquared','sqrtprice'],axis=1)
another_newdata= data.drop(['sequence'], axis=1)
another_newdata

            company  price ticker  year  sqrtprice  pricesquared
0  American Express     95    AXP  2014        NaN           NaN
1             Cisco     25   CSCO  2014        NaN           NaN
2       Walt Disney     81    DIS  2014        NaN           NaN
3         Microsoft     78   MSFT  2014        NaN           NaN
4           Walmart     89    WMT  2014        NaN           NaN

In [71]:
newdata
data

            company  price ticker  year  sequence
0  American Express     95    AXP  2014         0
1             Cisco     25   CSCO  2014         5
2       Walt Disney     81    DIS  2014        10
3         Microsoft     78   MSFT  2014        15
4           Walmart     89    WMT  2014        20

            company  price ticker  year  sqrtprice  pricesquared  sequence
0  American Express     95    AXP  2014        NaN           NaN         0
1             Cisco     25   CSCO  2014        NaN           NaN         5
2       Walt Disney     81    DIS  2014        NaN           NaN        10
3         Microsoft     78   MSFT  2014        NaN           NaN        15
4           Walmart     89    WMT  2014        NaN           NaN        20